from flask import Flask, render_template, jsonify

app = Flask(__name__)

# بنك الأسئلة الذي أرسلته
QUESTIONS_BANK = {
    "أ": [{"q": "من الجمال", "a": "الحسن"}],
    "ب": [{"q": "ثاني حروف الهجاء", "a": "باء"}],
    "ت": [{"q": "عاصمة اليابان", "a": "طوكيو"}],
    "ث": [{"q": "يرتديها الملوك على رؤوسهم", "a": "تاج"}],
    "ج": [{"q": "مخلوقات غيبية خلقها الله من نار", "a": "الجن"}],
    "ح": [{"q": "الحيوان المعروف بسفينة الصحراء", "a": "الجمل"}],
    "خ": [{"q": "مادة تصنع منها الطاولات والكبائن", "a": "الخشب"}],
    "د": [{"q": "عاصمة المملكة العربية السعودية", "a": "الرياض"}],
    "ذ": [{"q": "عضو في الجسم نذوق به الطعام", "a": "اللسان"}],
    "ر": [{"q": "من شهور السنة الهجرية يأتي بعد شعبان", "a": "رمضان"}],
    "ز": [{"q": "كوكب يشتهر بحلقاته الجميلة حوله", "a": "زحل"}],
    "س": [{"q": "نجم تشرق منه الأرض بالدفء والنور", "a": "الشمس"}],
    "ش": [{"q": "حيوان مفترس يلقب بملك الغابة", "a": "الأسد"}]
}

@app.route('/')
def index():
    return render_template('player.html')

@app.route('/get_questions')
def get_questions():
    return jsonify(QUESTIONS_BANK)

if __name__ == '__main__':
    app.run(debug=True)